
Процедура ОбработкаПроведения(Отказ, Режим)
	#Область ВзаиморасчетыСКассирами
	Движения.ВзаиморасчетыСКассирами.Записывать=Истина;
	//-------- Метод распределения суммы по ФИФО
	ТаблицаВзаиморасчетов=МодульПроведенияНаСервере.ВозвратДетализацииПоКассирам(Покупатель,Дата,"ПроведениеДокумента");
	СуммаПлатежаЗначение=СуммаПлатежа;
	Остаток=0;
	Для каждого СтрТаб из ТаблицаВзаиморасчетов Цикл
		Если СуммаПлатежаЗначение>0 Тогда	
			Движение=Движения.ВзаиморасчетыСКассирами.Добавить();
			Остаток=СуммаПлатежаЗначение-СтрТаб.СуммаЗадолженности;
			Если Остаток>0 Тогда
			Движение.СуммаЗадолженности=СуммаПлатежаЗначение-Остаток;
		Иначе
			Движение.СуммаЗадолженности=СуммаПлатежаЗначение;
			КонецЕсли;
			СуммаПлатежаЗначение=СуммаПлатежаЗначение-СтрТаб.СуммаЗадолженности;
			Движение.Билет=СтрТаб.Билет;
			Движение.ВалютаВзаиморасчетов=ВалютаОплаты;
			Движение.ВидДвижения=ВидДвиженияНакопления.Расход;
			Движение.Организация=Справочники.Организация.ОсновнаяОрганизация;
			Движение.Период=Дата;
			Движение.Субагент=Покупатель;
			КонецЕсли;
	КонецЦикла;
	//--------
	#КонецОбласти
	#Область ДДС
	Движения.ДвижениеДенежныхСредств.Записывать=Истина;
	ДС=Движения.ДвижениеДенежныхСредств.Добавить();
	ДС.ВидДвижения=ВидДвиженияНакопления.Приход;
	Если Касса<>Неопределено Тогда
		ДС.БанковскийСчетКасса=Касса;
	Иначе
		ДС.БанковскийСчетКасса=БанковскийСчет;
	КонецЕсли;
	ДС.Покупатель=Покупатель;
	ДС.Период=Дата;
	ДС.Сумма=СуммаПлатежа;
	ДС.Валюта=ВалютаОплаты;
	ДС.ХозяйственнаяОперация=Перечисления.ХозОперации.ПоступлениеОтКлиента;
	#КонецОбласти
КонецПроцедуры
