
// Функция для возврата суммы задолженности используется в форме документа ПКО
// 
// Параметры:
// 	Кассир
// 	Дата
// Возвращаемое значение:
// 	Число - Описание
Функция ВозвратОстатковПоЗадолженности(Кассир,Дата)Экспорт	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВзаиморасчетыСКассирамиОстаткиИОбороты.СуммаЗадолженностиКонечныйОстаток КАК СуммаЗадолженностиКонечныйОстаток
	|ИЗ
	|	РегистрНакопления.ВзаиморасчетыСКассирами.ОстаткиИОбороты(, &Дата, День, , ) КАК ВзаиморасчетыСКассирамиОстаткиИОбороты
	|ГДЕ
	|	ВзаиморасчетыСКассирамиОстаткиИОбороты.Субагент = &Кассир";	
	
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Кассир", Кассир);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	СуммаВзаиморасчетов=0;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
	СуммаВзаиморасчетов=ВыборкаДетальныеЗаписи.СуммаЗадолженностиКонечныйОстаток;	
КонецЦикла;
Возврат СуммаВзаиморасчетов;
КонецФункции