&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	Если Объект.Кассир=Неопределено ИЛИ Объект.Курс=0 Тогда	
	Предупреждение("Поле Кассир или Курс не заполнены",10,"Не заполнены поля");
	    
Иначе
	МассивЗначений=Новый Массив;
	МассивЗначений.Добавить(Объект.Кассир);
	МассивЗначений.Добавить(Объект.Курс);
	МассивЗначений.Добавить(Объект.ВзаиморасчетыВедутся);
	Оповестить("ПередачаКассира",МассивЗначений);
	ЭтаФорма.Закрыть();
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
Флаг=УстановкаВалюты(Параметры.ВалютаВзаиморасчетов);
Если Флаг Тогда
	Элементы.Курс.ТолькоПросмотр=Истина;
	Элементы.ВзаиморасчетыВедутся.ТолькоПросмотр=Истина;
	Объект.ВзаиморасчетыВедутся=Истина;
КонецЕсли;
КонецПроцедуры

&НаСервере 
Функция УстановкаВалюты(Валюта)
	ДанныеФормы=РеквизитФормыВЗначение("Объект");
	ФлагВозврата=Ложь;
	Если Валюта=Справочники.Валюта.НайтиПоНаименованию("TJS") Тогда
		ДанныеФормы.Курс=1;
		ДанныеФормы.Валюта=Валюта;
		ФлагВозврата=Истина;
	Иначе
		ДанныеФормы.Валюта=Валюта;
	КонецЕсли;
ЗначениеВРеквизитФормы(ДанныеФормы,"Объект");
Возврат ФлагВозврата;
КонецФункции

&НаКлиенте
Процедура ВзаиморасчетыВедутсяПриИзменении(Элемент)
	Если Объект.ВзаиморасчетыВедутся Тогда
		Объект.Курс=1;
		Элементы.Курс.ТолькоПросмотр=Истина;
	Иначе
		Объект.Курс=0;
		Элементы.Курс.ТолькоПросмотр=Ложь;
	КонецЕсли;
КонецПроцедуры
