
&НаКлиенте
Процедура ВводОстатоковПоКассе(Команда)
	ПараметрыОткрытия=Новый Структура;
	ПараметрыОткрытия.Вставить("ВидОперации","Сальдо");
	ОткрытьФорму("Документ.ВводОстатков.Форма.ФормаДокумента",ПараметрыОткрытия);
КонецПроцедуры

&НаКлиенте
Процедура ЗадолженностьКассиров(Команда)
	ПараметрыОткрытия=Новый Структура;
	ПараметрыОткрытия.Вставить("ВидОперации","Дебит");
	ОткрытьФорму("Документ.ВводОстатков.Форма.ФормаДокумента",ПараметрыОткрытия);
КонецПроцедуры

&НаКлиенте
Процедура ЗадолженностьПередПоставщиками(Команда)
	ПараметрыОткрытия=Новый Структура;
	ПараметрыОткрытия.Вставить("ВидОперации","Кредит");
	ОткрытьФорму("Документ.ВводОстатков.Форма.ФормаДокумента",ПараметрыОткрытия);
КонецПроцедуры
