
&НаСервере
Процедура НайтиБилетНаСервере()
ДанныеФормы=РеквизитФормыВЗначение("Объект");
Субагент=Неопределено;
МаскиБилетов=ОбработкаТекстовыхДанных.ОчисткаПустыхСтрокДляВозврата(ДанныеФормы.МаскаБилета);
Таблица=МодульПроведенияНаСервере.ВозвратСтрокиПродаж(МаскиБилетов);
Для каждого СтрТаб из Таблица Цикл
Субагент=СтрТаб.Субагент;	
КонецЦикла;
ДанныеФормы.Покупатель=Субагент;
ДанныеФормы.ВозвратБилета.Очистить();
ДанныеФормы.ВозвратБилета.Загрузить(Таблица);
ЗначениеВРеквизитФормы(ДанныеФормы,"Объект");
КонецПроцедуры

&НаКлиенте
Процедура НайтиБилет(Команда)
	НайтиБилетНаСервере();
КонецПроцедуры

&НаСервере
Функция ВалютаОбработкаВыбораНаСервере(ВыбранноеЗначение)
	ДанныеФормы=РеквизитФормыВЗначение("Объект");
	СтруктураДанных=Новый Структура;
	СтруктураВозврата=Новый Структура;
	ДатаПродажи=Неопределено;
    ФлагПроверки=Неопределено;
Для каждого СтрТаб из ДанныеФормы.ВозвратБилета Цикл
	Если ВыбранноеЗначение<>СтрТаб.ВалютаВзаиморасчетов Тогда
	ФлагПроверки=Ложь;
	СтруктураДанных.Вставить("ВалютаВзаиморасчетов",ВыбранноеЗначение);
	СтруктураДанных.Вставить("ДатаПродажи",СтрТаб.ДатаПродажи);
	СтруктураДанных.Вставить("Агенство",СтрТаб.АВК);
	ДатаПродажи=СтрТаб.ДатаПродажи;
	Иначе 	
	ФлагПроверки=Истина;
	КонецЕсли; 
КонецЦикла;
Если ФлагПроверки Тогда
СтруктураВозврата.Вставить("Флаг",Истина);
Иначе
Курс=МодульПроведенияНаСервере.ВозвратКурсаАгенств(СтруктураДанных,Истина);
СтруктураВозврата.Вставить("Курс",Курс);
СтруктураВозврата.Вставить("ДатаПродажи",ДатаПродажи);
СтруктураВозврата.Вставить("Флаг",Ложь);
КонецЕсли; 
Возврат СтруктураВозврата;
КонецФункции
&НаКлиенте
Процедура ВалютаОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Данные=ВалютаОбработкаВыбораНаСервере(ВыбранноеЗначение);
	Если Данные.Флаг Тогда
	Элементы.Курс_надпись.Заголовок="";
	Элементы.Курс_Значение.Заголовок="";	
	Иначе
	Элементы.Курс_надпись.Заголовок="Курс агенства на : "+Формат(Данные.ДатаПродажи, "ДФ=dd.MM.yy");
	Элементы.Курс_Значение.Заголовок=Строка(Данные.Курс);	
	КонецЕсли; 	
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
ДанныеФормы=РеквизитФормыВЗначение("Объект");
Если ДанныеФормы.ЭтоНовый() Тогда
ДанныеФормы.Валюта=Справочники.Валюта.НайтиПоНаименованию("TJS");
ЗначениеВРеквизитФормы(ДанныеФормы,"Объект");
КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ) 
	ПриОткрытииНаСервере();
	Если Объект.ШтрафВИнВ Тогда
	Элементы.Валюта.ТолькоПросмотр=Ложь;
	Элементы.СуммаШтрафа.ТолькоПросмотр=Истина;
	Элементы.СуммаШтрафаВВалюте.Видимость=Истина;
    Иначе
	Элементы.Валюта.ТолькоПросмотр=Истина;
	Элементы.СуммаШтрафа.ТолькоПросмотр=Ложь;
	Элементы.СуммаШтрафаВВалюте.Видимость=Ложь;
	КонецЕсли;
	Если Параметры.ВидОперации="Вынужденный" Тогда
	Объект.ВидОперации=ПредопределенноеЗначение("Перечисление.ВидВозврата.ВынужденныйВозврат");
	Объект.Сборы=ПредопределенноеЗначение("Перечисление.ОбщиеПеречисления.СборВозвращается");
	Элементы.Сборы.ТолькоПросмотр=Истина;
	ЭтаФорма.Заголовок="Вынужденный возврат";
	ИначеЕсли Параметры.ВидОперации="Добровольный" Тогда
	Объект.ВидОперации=ПредопределенноеЗначение("Перечисление.ВидВозврата.ДобровольныйВозврат");
	ЭтаФорма.Заголовок="Добровольный возврат";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ШтрафВИнВПриИзменении(Элемент)
	Если Объект.ШтрафВИнВ Тогда
	Элементы.Валюта.ТолькоПросмотр=Ложь;
	Элементы.СуммаШтрафа.ТолькоПросмотр=Истина;
	Элементы.СуммаШтрафаВВалюте.Видимость=Истина;
Иначе
	Элементы.Валюта.ТолькоПросмотр=Истина;
	Элементы.СуммаШтрафа.ТолькоПросмотр=Ложь;
	Элементы.СуммаШтрафаВВалюте.Видимость=Ложь;
    Объект.СуммаШтрафа=0;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура СуммаШтрафаВВалютеПриИзменении(Элемент)
	Данные=ВалютаОбработкаВыбораНаСервере(Объект.Валюта);
	Объект.СуммаШтрафа=Данные.Курс*Объект.СуммаШтрафаВВалюте;
	Элементы.Курс_надпись.Заголовок="Курс агенства на : "+Формат(Данные.ДатаПродажи, "ДФ=dd.MM.yy");
	Элементы.Курс_Значение.Заголовок=Строка(Данные.Курс);
КонецПроцедуры
