//TODO:Проверить проводки документа в Вынужденном статусе
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	#Область РегВозвраты 
	Движения.ВозвратыКлиентов.Записывать=Истина;
	Для каждого СтрТаб из ВозвратБилета Цикл
		Движение=Движения.ВозвратыКлиентов.Добавить();
		Движение.ВидДвижения=ВидДвиженияНакопления.Приход;
		Движение.Билет=СтрТаб.Билет;
		Движение.Покупатель=Покупатель;
		Если ВидОперации=Перечисления.ВидВозврата.ВынужденныйВозврат Тогда
		Движение.СуммаВозвратаКлиенту=СтрТаб.Итого-СуммаШтрафа;
		Движение.Штраф=0;
		ИначеЕсли ВидОперации=Перечисления.ВидВозврата.ДобровольныйВозврат Тогда	
		Движение.СуммаВозвратаКлиенту=СтрТаб.Итого-СуммаШтрафа;
		Движение.Штраф=СуммаШтрафа;
		КонецЕсли;
		Движение.Период=Дата;
		Движение.ВалютаВзаиморасчетов=Валюта;
	КонецЦикла;
	#КонецОбласти
	#Область РегДДС
	//Возврат основной сумму покупателю
	Движения.ДвижениеДенежныхСредств.Записывать=Истина;
	Для каждого СтрТаб из ВозвратБилета Цикл
		Движение=Движения.ДвижениеДенежныхСредств.Добавить();
		Движение.ВидДвижения=ВидДвиженияНакопления.Расход;
		Движение.Покупатель=Покупатель;
		Если ВидОперации=Перечисления.ВидВозврата.ВынужденныйВозврат Тогда
		Движение.Сумма=СтрТаб.Итого;	
		ИначеЕсли ВидОперации=Перечисления.ВидВозврата.ДобровольныйВозврат Тогда
		Движение.Сумма=СтрТаб.Итого-СуммаШтрафа;
		КонецЕсли;
		Движение.Период=Дата;
		Движение.ВалютаВзаиморасчетов=Валюта;
		Движение.ХозяйственнаяОперация=Перечисления.ХозОперации.ВозвратПокупателю;
		Движение.БанковскийСчетКасса=КассаБанковскийСчет;
	КонецЦикла;
	//-----------------------------------------------
	//Формирование движения по оприходованию штрафа
	Если ВидОперации=Перечисления.ВидВозврата.ДобровольныйВозврат Тогда
	Движения.ДвижениеДенежныхСредств.Записывать=Истина;
	Для каждого СтрТаб из ВозвратБилета Цикл
		Движение=Движения.ДвижениеДенежныхСредств.Добавить();
		Движение.ВидДвижения=ВидДвиженияНакопления.Приход;
		Движение.Покупатель=Покупатель;
		Если Сборы=Перечисления.ОбщиеПеречисления.СборВозвращается Тогда
			Движение.Сумма=СуммаШтрафа;
		ИначеЕсли Сборы=Перечисления.ОбщиеПеречисления.СборыНеВозвращаются Тогда
			Движение.Сумма=СуммаШтрафа+СтрТаб.АГС;
		КонецЕсли;
		Движение.Период=Дата;
		Движение.ВалютаВзаиморасчетов=Валюта;
		Движение.ХозяйственнаяОперация=Перечисления.ХозОперации.Штраф;
		Движение.БанковскийСчетКасса=КассаБанковскийСчет;
	КонецЦикла;
	КонецЕсли;
	//----------------------------------------------
	#КонецОбласти
	#Область Взаиморасчеты
	Движения.ВзаиморасчетыСАгенствами.Записывать=Истина;
	Для каждого СтрТаб из ВозвратБилета Цикл
		Движение=Движения.ВзаиморасчетыСАгенствами.Добавить();
		Движение.Период=Дата;
		Движение.Авиакомпания=СтрТаб.АВК;
		Движение.Билет=СтрТаб.Билет;
		Движение.ВидДвижения=ВидДвиженияНакопления.Расход;
		Движение.ВидОперации=Перечисления.ХозОперации.ВозвратПокупателю;
		Движение.СуммаЗадолженностиАГН=СтрТаб.СуммаОтАВК+СтрТаб.Тариф+СтрТаб.АГС;
		Движение.ВалютаВзаиморасчетов=Валюта;
	КонецЦикла;
	#КонецОбласти
	#Область ВзаиморасчетыСКассирами
	Движения.ВзаиморасчетыСКассирами.Записывать=Истина;
	//-------- Метод распределения суммы по ФИФО
	Если ВидОперации=Перечисления.ВидВозврата.ДобровольныйВозврат Тогда
	ТаблицаВзаиморасчетов=МодульПроведенияНаСервере.ВозвратДетализацииПоКассирам(Покупатель,Дата,"ПроведениеДокумента");
	СуммаПлатежаЗначение=СуммаШтрафа;
	Остаток=0;
	Для каждого СтрТаб из ТаблицаВзаиморасчетов Цикл
		Если СуммаПлатежаЗначение>0 Тогда	
			Движение=Движения.ВзаиморасчетыСКассирами.Добавить();
			Движение.ВидДвижения=ВидДвиженияНакопления.Расход;
			Остаток=СуммаПлатежаЗначение-СтрТаб.СуммаЗадолженности;
			Если Остаток>0 Тогда
			Движение.СуммаЗадолженности=СуммаПлатежаЗначение-Остаток;
		Иначе
			Движение.СуммаЗадолженности=СуммаПлатежаЗначение;
			КонецЕсли;
			СуммаПлатежаЗначение=СуммаПлатежаЗначение-СтрТаб.СуммаЗадолженности;
			Движение.Билет=СтрТаб.Билет;
			Движение.ВалютаВзаиморасчетов=Валюта;
			Движение.ВидДвижения=ВидДвиженияНакопления.Расход;
			Движение.Организация=Справочники.Организация.ОсновнаяОрганизация;
			Движение.Период=Дата;
			Движение.Субагент=Покупатель;
			КонецЕсли;
	КонецЦикла;
	ИначеЕсли ВидОперации=Перечисления.ВидВозврата.ВынужденныйВозврат Тогда
		Для каждого СтрТаб из ВозвратБилета Цикл
		Движение=Движения.ВзаиморасчетыСКассирами.Добавить();
		Движение.ВидДвижения=ВидДвиженияНакопления.Расход;
		Движение.Билет=СтрТаб.Билет;
		Движение.ВалютаВзаиморасчетов=СтрТаб.ВалютаВзаиморасчетов;
		Движение.Организация=Справочники.Организация.ОсновнаяОрганизация;
		Движение.Субагент=Покупатель;
		Движение.СуммаЗадолженности=СтрТаб.СуммаСУБ+СтрТаб.Тариф+СтрТаб.АГС;
		Движение.Период=Дата;
		КонецЦикла;
	КонецЕсли;
	#КонецОбласти
КонецПроцедуры

Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	Если ВидОперации=Перечисления.ВидВозврата.ВынужденныйВозврат Тогда
	Индекс=ПроверяемыеРеквизиты.Найти("СуммаШтрафа");
	ПроверяемыеРеквизиты.Удалить(Индекс);
	КонецЕсли;
КонецПроцедуры
