//&НаКлиенте
//Процедура Заполнить(Команда)
//	ЗаполнитьНаСервере()	
//КонецПроцедуры
//&НаСервере
//Процедура ЗаполнитьНаСервере()
//	ДанныеФормы=РеквизитФормыВЗначение("Объект");
//	Таблица=МодульПроведенияНаСервере.ВозвратДетализацииПоКассирам(ДанныеФормы.Покупатель,ТекущаяДата(),"МодульФормы");
//	ДанныеФормы.Расшифровка.Загрузить(Таблица);
//	ЗначениеВРеквизитФормы(ДанныеФормы,"Объект");
//КонецПроцедуры

&НаКлиенте
Процедура ПокупательОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Сумма=ВозвратСуммы(ВыбранноеЗначение);
	Элементы.Долг.Заголовок="Долг равен: "+Сумма;
КонецПроцедуры
&НаСервере
Функция ВозвратСуммы(Кассир)
	ДанныеФормы=РеквизитФормыВЗначение("Объект");	
	Сумма=ОбщийМодуль.ВозвратОстатковПоЗадолженности(Кассир,ДанныеФормы.Дата);
	Возврат Сумма;	
КонецФункции

//&НаКлиенте
//Процедура СуммаПлатежаОкончаниеВводаТекста(Элемент, Текст, ДанныеВыбора, ПараметрыПолученияДанных, СтандартнаяОбработка)
//	Оповещение=Новый ОписаниеОповещения("ОбработкаДиалога",ЭтотОбъект);
//	ПоказатьВопрос(Оповещение,"Распеределить по ровну",РежимДиалогаВопрос.ДаНет,0);
//КонецПроцедуры
//&НаКлиенте
//Процедура ОбработкаДиалога(Результат,Параметр)Экспорт
//	Если Результат=КодВозвратаДиалога.Да Тогда
//		ПараметрРаспределения="По ровну";
//		РаспределениеРасчетов(ПараметрРаспределения);
//	Иначе
//		ПараметрРаспределения="На первую строку";
//		РаспределениеРасчетов(ПараметрРаспределения);
//	КонецЕсли;
//КонецПроцедуры

//&НаСервере
//Процедура РаспределениеРасчетов(ПараметрРаспределения)
//	ДанныеФормы=РеквизитФормыВЗначение("Объект");
//	Если ПараметрРаспределения="По ровну" Тогда
//		КоличествоСтрокТаблицы=ДанныеФормы.РасшифровкаПлатежа.Количество();
//		СредняяСумма=ДанныеФормы.СуммаПлатежа/КоличествоСтрокТаблицы;
//		Для каждого СтрТаб из ДанныеФормы.расшифровкаПлатежа Цикл
//			СтрТаб.СуммаПлатежа=СредняяСумма;	
//		КонецЦикла;
//		ЗначениеВРеквизитФормы(ДанныеФормы,"Объект");
//	ИначеЕсли ПараметрРаспределения="На первую строку" Тогда
//		Для каждого СтрТаб из ДанныеФормы.РасшифровкаПлатежа Цикл
//			СтрТаб.СуммаПлатежа=ДанныеФормы.СуммаПлатежа;
//			Прервать;
//		КонецЦикла;
//		ЗначениеВРеквизитФормы(ДанныеФормы,"Объект");
//	КонецЕсли;
//КонецПроцедуры
&НаСервере
Функция ОбработкаВыбораНаСервере(ВыбранноеЗначение)
	Данные="";
	Если ВыбранноеЗначение=Перечисления.ВидОплаты.Наличный Тогда
		Данные="Наличный";
	ИначеЕсли ВыбранноеЗначение=Перечисления.ВидОплаты.Безналичный Тогда
		Данные="Безналичный";
	КонецЕсли;
	Возврат Данные;
КонецФункции
&НаКлиенте
Процедура ВидОплатыОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	Данные=ОбработкаВыбораНаСервере(ВыбранноеЗначение);
	Если Данные="Наличный" Тогда
		Элементы.Касса.ТолькоПросмотр=Ложь;
		Элементы.БанковскийСчет.ТолькоПросмотр=Истина;
	ИначеЕсли Данные="Безналичный" Тогда
		Элементы.Касса.Доступность=Истина;
		Элементы.БанковскийСчет.ТолькоПросмотр=Ложь;	
	КонецЕсли;
КонецПроцедуры
