
Процедура ОбработкаПроведения(Отказ, Режим)
	#Область РегПродажи
	Движения.ПродажиБилетов.Записывать = Истина;
	СуммаСуб=0;
	СуммаАГН=0;
	МассивБилетов=Новый Массив;
	Для Каждого ТекСтрокаБилеты Из Билеты Цикл
		Движение = Движения.ПродажиБилетов.Добавить();
		Движение.Период = Дата;
		Движение.Субагент = Кассир;
		Движение.НомерБилета = Номер;
		Движение.PNR = ТекСтрокаБилеты.PNR;
		Движение.ДатаПродажи = ТекСтрокаБилеты.Выписан;
		Движение.ДатаВылета = ТекСтрокаБилеты.ДатаВылета;
		Движение.Направление=ТекСтрокаБилеты.Направление;
		Движение.Итого = ТекСтрокаБилеты.ИтогоСумма;
		Движение.Тариф = ТекСтрокаБилеты.СуммаТарифа;
		Агенство=МодульПроведенияНаСервере.НайтиПульт(ТекСтрокаБилеты.Валидатор);
		Движение.АВК = Агенство;
		КлючьАналитики=Строка(ТекСтрокаБилеты.АВК)+Строка(ТекСтрокаБилеты.Направление)+Строка(Агенство);
		СуммаОтАВК=МодульПроведенияНаСервере.ВозвратПроцентовАГН(КлючьАналитики,ТекСтрокаБилеты.Выписан);		
		СуммаОтСУБ=МодульПроведенияНаСервере.ВозвратПроцентовСУБ(КлючьАналитики,Кассир,КонецДня(ТекСтрокаБилеты.Выписан));
		Движение.СуммаОтАВК=СуммаОтАВК*ТекСтрокаБилеты.СуммаТарифа;
		Движение.СуммаСУБ=СуммаОтСУБ*ТекСтрокаБилеты.СуммаТарифа;
		Движение.ТарифВВалюте=ТекСтрокаБилеты.СуммаТарифа*ТекСтрокаБилеты.Курс;
		Движение.ИтогоВВалюте=ТекСтрокаБилеты.ИтогоСумма*ТекСтрокаБилеты.Курс;
		Движение.АГСВВалюте=ТекСтрокаБилеты.Сборы*ТекСтрокаБилеты.Курс;
		СуммаАГН=Движение.СуммаОтАВК;
		СуммаСуб=Движение.СуммаСУБ;
		Движение.Прибыль=СуммаАГН-СуммаСуб;
		Движение.АГН=СуммаОтАВК;
		Движение.СуммаНДС=МодульПроведенияНаСервере.ВозвратНДС(ТекСтрокаБилеты.Валидатор,СуммаОтАВК);
		Движение.СУБ=СуммаОтСУБ;
		Движение.Билет=ТекСтрокаБилеты.Билет;
		Движение.ВалютаБилета=ТекСтрокаБилеты.ВалютаБилета;
		Движение.АГС=ТекСтрокаБилеты.Сборы;
		Движение.ВидОперации=Перечисления.ХозОперации.ПродажаБилета;
		Движение.ВалютаВзаиморасчетов=ТекСтрокаБилеты.ВалютаВзаиморасчетов;
		МассивБилетов.Добавить(ТекСтрокаБилеты.Билет);
	КонецЦикла;
	#КонецОбласти
	#Область РегВзаиморасчесты
	Движения.ВзаиморасчетыСАгенствами.Записывать=Истина;
	Для каждого ТекСтрокаБилеты Из Билеты Цикл
		ДвижениеРасчеты = Движения.ВзаиморасчетыСАгенствами.Добавить();
		ДвижениеРасчеты.ВидДвижения=ВидДвиженияНакопления.Приход;
		ДвижениеРасчеты.СуммаЗадолженностиАГН=ТекСтрокаБилеты.ИтогоСумма-СуммаАГН;
		ДвижениеРасчеты.Период = Дата;
		ДвижениеРасчеты.Авиакомпания=МодульПроведенияНаСервере.НайтиПульт(ТекСтрокаБилеты.Валидатор);
		ДвижениеРасчеты.Билет=ТекСтрокаБилеты.Билет;
		ДвижениеРасчеты.ВалютаВзаиморасчетов=ТекСтрокаБилеты.ВалютаВзаиморасчетов;
		ДвижениеРасчеты.ВидОперации=Перечисления.ХозОперации.ПродажаБилета;
	КонецЦикла;
	#КонецОбласти
	#Область РегВзаиморасчетыСКассирами
	Движения.ВзаиморасчетыСКассирами.Записывать=Истина;
	Для каждого ТекСтрокаБилеты ИЗ Билеты Цикл
	ДвижениеРасчеты=Движения.ВзаиморасчетыСКассирами.Добавить();
	ДвижениеРасчеты.ВидДвижения=ВидДвиженияНакопления.Приход;
	Агенство=МодульПроведенияНаСервере.НайтиПульт(ТекСтрокаБилеты.Валидатор);
	РезультатПоВалюте=МодульПроведенияНаСервере.ВедутсяВзаиморасчетыВВалюте(ТекСтрокаБилеты.Валидатор,Агенство);
	СуммаИтого=ТекСтрокаБилеты.ИтогоСумма;
	Если РезультатПоВалюте И ТекСтрокаБилеты.ВалютаБилета<>Справочники.Валюта.НайтиПоНаименованию("TJS")  Тогда
	СуммаИтого=СуммаИтого*ТекСтрокаБилеты.Курс;
	СуммаСуб=СуммаСуб*ТекСтрокаБилеты.Курс;	
	ДвижениеРасчеты.ВалютаВзаиморасчетов=ТекСтрокаБилеты.ВалютаБилета;
	ДвижениеРасчеты.СуммаЗадолженности=СуммаИтого-СуммаСуб;
	Иначе
	ДвижениеРасчеты.ВалютаВзаиморасчетов=ТекСтрокаБилеты.ВалютаВзаиморасчетов;
	ДвижениеРасчеты.СуммаЗадолженности=СуммаИтого-СуммаСуб;
	КонецЕсли;
	ДвижениеРасчеты.Билет=ТекСтрокаБилеты.Билет;
	ДвижениеРасчеты.Организация=Справочники.Организация.ОсновнаяОрганизация;
	ДвижениеРасчеты.Период=Дата;
	ДвижениеРасчеты.Субагент=Кассир;	
	КонецЦикла;
	#КонецОбласти
	//Отправка обработнных документов для обработки в регистре ЖурналыДокументов
	МодульПроведенияНаСервере.ОбработкаРегистраЖурнал(МассивБилетов,"Проведение");
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)	
	МодульПроведенияНаСервере.ОбработкаРегистраЖурнал(Билеты.ВыгрузитьКолонку("Билет"),"ОтменаПроведения");
КонецПроцедуры


Процедура ПередУдалением(Отказ)
	МодульПроведенияНаСервере.ОбработкаРегистраЖурнал(Билеты.ВыгрузитьКолонку("Билет"),"ОтменаПроведения");
КонецПроцедуры

