
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	Если Параметры.ВидОперации="Сальдо" Тогда
		Объект.ВидОперации=ПредопределенноеЗначение("Перечисление.ВидыВводаНачальныхОстатков.ОстатокПоКассаБанковскийСчет");
		Элементы.ГруппаОстатокПоКассе.Видимость=Истина;
		Элементы.ГруппаОстатокПоЗадолженности.Видимость=Ложь;
		Элементы.ГруппаОстатокКредиторскойЗадолженности.Видимость=Ложь;
		ЭтаФорма.Заголовок="Ввод начальных остатков по кассе";
	ИначеЕсли Параметры.ВидОперации="Дебит" Тогда
		Объект.ВидОперации=ПредопределенноеЗначение("Перечисление.ВидыВводаНачальныхОстатков.ЗадолженностьКассиров");
		Элементы.ГруппаОстатокПоКассе.Видимость=Ложь;
		Элементы.ГруппаОстатокПоЗадолженности.Видимость=Истина;
		Элементы.ГруппаОстатокКредиторскойЗадолженности.Видимость=Ложь;
		ЭтаФорма.Заголовок="Ввод начальных остатков по задолженности кассиров";
	ИначеЕсли Параметры.ВидОперации="Кредит" Тогда
		Объект.ВидОперации=ПредопределенноеЗначение("Перечисление.ВидыВводаНачальныхОстатков.ЗадолженностьПередПОставщиками");
		Элементы.ГруппаОстатокКредиторскойЗадолженности.Видимость=Истина;
		Элементы.ГруппаОстатокПоЗадолженности.Видимость=Ложь;
		Элементы.ГруппаОстатокПоКассе.Видимость=Ложь;
		ЭтаФорма.Заголовок="Ввод начальных остатков перед поставщиками";
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОстатокКредиторскойЗадолженностиСуммаПриИзменении(Элемент)
	Данные=Элементы.ОстатокКредиторскойЗадолженности.ТекущиеДанные;
	Данные.Статус="";
	Если Данные.Сумма<0 Тогда
		Данные.Статус="Аванс"	
	Иначе
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ОстатокПоЗадолженностиСуммаПриИзменении(Элемент)
	Данные=Элементы.ОстатокПоЗадолженности.ТекущиеДанные;
	Данные.Статус="";
	Если Данные.Сумма<0 Тогда
		Данные.Статус="Аванс"	
	Иначе
	КонецЕсли;	
КонецПроцедуры
