Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Если ВидОперации=Перечисления.ВидыВводаНачальныхОстатков.ЗадолженностьКассиров Тогда
	#Область ОстаткиПоЗадолженности
	Движения.ВзаиморасчетыСКассирами.Записывать=Истина;
	Для каждого СтрТаб из ОстатокПоЗадолженности Цикл
	Движение=Движения.ВзаиморасчетыСКассирами.Добавить();
	Движение.ВалютаВзаиморасчетов=СтрТаб.ВалютаВзаиморасчетов;
	Движение.Организация=Справочники.Организация.ОсновнаяОрганизация;
	Движение.ВидДвижения=ВидДвиженияНакопления.Приход;
	Движение.Субагент=СтрТаб.Кассир;
	Движение.СуммаЗадолженности=СтрТаб.Сумма;
	Движение.Период=Дата;
	КонецЦикла;
	#КонецОбласти
	ИначеЕсли ВидОперации=Перечисления.ВидыВводаНачальныхОстатков.ОстатокПоКассаБанковскийСчет Тогда
	#Область ОстаткиПоКассам
	Движения.ДвижениеДенежныхСредств.Записывать=Истина;
	Для каждого СтрТаб из ОстатокПоКассе Цикл;
	Движение=Движения.ДвижениеДенежныхСредств.Добавить();
	Движение.ВидДвижения=ВидДвиженияНакопления.Приход;
	Движение.БанковскийСчетКасса=СтрТаб.Касса;
	Движение.ВалютаВзаиморасчетов=СтрТаб.Касса.ВалютаВзаиморасчетов;
	Движение.Период=Дата;
	Движение.Сумма=СтрТаб.Сумма;
	КонецЦикла;
	#КонецОбласти
	ИначеЕсли ВидОперации=Перечисления.ВидыВводаНачальныхОстатков.ЗадолженностьПередПоставщиками Тогда
	#Область ОстаткиПередПоставщиками
	Движения.ВзаиморасчетыСАгенствами.Записывать=Истина;
	Для каждого СтрТаб из ОстатокКредиторскойЗадолженности Цикл
	Движение=Движения.ВзаиморасчетыСАгенствами.Добавить();
	Движение.Авиакомпания=СтрТаб.Поставщик;
	Если СтрТаб.Сумма>0 Тогда
	Движение.ВидДвижения=ВидДвиженияНакопления.Приход;
Иначе
	Движение.ВидДвижения=ВидДвиженияНакопления.Расход;
	КонецЕсли;
	Движение.Период=Дата;
	Движение.СуммаЗадолженностиАГН=СтрТаб.Сумма;
	КонецЦикла;
	#КонецОбласти
	КонецЕсли;
КонецПроцедуры
