
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Если НужнаКонвертация Тогда
	СуммаПлатежаЗначение=СуммаКонвертации;
	ВалютаПерем=ВалютаКонвертации;
Иначе
	СуммаПлатежаЗначение=СуммаОплаты;
	ВалютаПерем=Валюта;
КонецЕсли;
	#Область ДДС
	Если НужнаКонвертация Тогда		
	//------Оприходование суммы от конвертации---------------------	
	Движения.ДвижениеДенежныхСредств.Записывать=Истина;
	ДП=Движения.ДвижениеДенежныхСредств.Добавить();
	ДП.ВидДвижения=ВидДвиженияНакопления.Приход;
	ДП.БанковскийСчетКасса=КассаКонвертации;
	ДП.ХозяйственнаяОперация=Перечисления.ХозОперации.Конвертация;
  ДП.Период=Дата;
  ДП.Валюта=ВалютаПерем;
	ДП.Сумма=СуммаКонвертации;
	//-------------------------------------------------------------
	ДС=Движения.ДвижениеДенежныхСредств.Добавить();
	ДС.ВидДвижения=ВидДвиженияНакопления.Расход;
	Если Касса<>Неопределено Тогда
		ДС.БанковскийСчетКасса=КассаКонвертации;
	Иначе
		ДС.БанковскийСчетКасса=КассаКонвертации;
	КонецЕсли;
	Если Поставщик<>Неопределено Тогда
		ДС.ХозяйственнаяОперация=Перечисления.ХозОперации.ОплатаПоставщику;
	Иначе
		ДС.ХозяйственнаяОперация=Перечисления.ХозОперации.ПрочийРасход;
	КонецЕсли;
	ДС.Поставщик=Поставщик;
	ДС.Период=Дата;
	ДС.Сумма=СуммаПлатежаЗначение;
	ДС.Валюта=ВалютаПерем;		
	Иначе
	Движения.ДвижениеДенежныхСредств.Записывать=Истина;
	ДС=Движения.ДвижениеДенежныхСредств.Добавить();
	ДС.ВидДвижения=ВидДвиженияНакопления.Расход;
	Если Касса<>Неопределено Тогда
		ДС.БанковскийСчетКасса=Касса;
	Иначе
		ДС.БанковскийСчетКасса=БанковскийСчет;
	КонецЕсли;
	Если Поставщик<>Неопределено Тогда
		ДС.ХозяйственнаяОперация=Перечисления.ХозОперации.ОплатаПоставщику;
	Иначе
		ДС.ХозяйственнаяОперация=Перечисления.ХозОперации.ПрочийРасход;
	КонецЕсли;
	ДС.Поставщик=Поставщик;
	ДС.Период=Дата;
	ДС.Сумма=СуммаПлатежаЗначение;
	ДС.ВалютаВзаиморасчетов=ВалютаПерем;
	КонецЕсли;
	#КонецОбласти
	
	#Область ВзаиморасчетыСАгенствами
	Движения.ВзаиморасчетыСАгенствами.Записывать=Истина;	
	ТаблицаДвижений=МодульПроведенияНаСервере.ВозвратДетализацииПоВзаиморасчетам(Поставщик,ВалютаПерем,Дата);	
Остаток=0;
	Если ТаблицаДвижений.Количество()>0 Тогда	
		//-------- Метод распределения суммы по ФИФО	
	Для каждого СтрТаб из ТаблицаДвижений Цикл
		Если СуммаПлатежаЗначение>0 Тогда	
			Движение=Движения.ВзаиморасчетыСАгенствами.Добавить();
			Движение.ВидДвижения=ВидДвиженияНакопления.Расход;
			Остаток=СуммаПлатежаЗначение-СтрТаб.СуммаЗадолженностиАГНКонечныйОстаток;
			Если Остаток>0 Тогда
			Движение.СуммаЗадолженностиАГН=СуммаПлатежаЗначение-Остаток;
		   Иначе
			Движение.СуммаЗадолженностиАГН=СуммаПлатежаЗначение;
			КонецЕсли;
			СуммаПлатежаЗначение=СуммаПлатежаЗначение-СтрТаб.СуммаЗадолженностиАГНКонечныйОстаток;
			Движение.Билет=СтрТаб.Билет;
			Движение.ВалютаВзаиморасчетов=ВалютаПерем;
			Движение.Период=Дата;
			Движение.Авиакомпания=Поставщик;
			Движение.ВидОперации=Перечисления.ХозОперации.ОплатаПоставщику;
			Движение.Регистратор=Ссылка;
			КонецЕсли;
		КонецЦикла;
	Иначе
			Движение=Движения.ВзаиморасчетыСАгенствами.Добавить();
			Движение.ВидДвижения=ВидДвиженияНакопления.Расход;
			Движение.СуммаЗадолженностиАГН=СуммаОплаты;
			Движение.ВалютаВзаиморасчетов=ВалютаПерем;
			Движение.Период=Дата;
			Движение.Авиакомпания=Поставщик;
			Движение.ВидОперации=Перечисления.ХозОперации.ОплатаПоставщику;
	КонецЕсли;		
	#КонецОбласти
КонецПроцедуры
